kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
  String filename = "IV_Report_Bed_" + String(st) + ".csv";
  server.sendHeader("Content-Disposition", "attachment; filename=" + filename);
  server.send(200, "text/csv; charset=utf-8", csv);
}

// ----------------------------------------------------------------------------
// ข้อมูลจุดเชื่อมต่อ (อ่านอย่างเดียว) และการตั้งเวลาจากเครื่องของผู้ใช้
// ----------------------------------------------------------------------------
void handleApStatus() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  String json = "{";
  json += "\"ssid\":\"" + jsonEscape(default_ap_ssid) + "\",";
  json += "\"password\":\"" + jsonEscape(default_ap_pass) + "\",";
  json += "\"apIP\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"channel\":" + String(currentWifiChannel()) + ",";
  json += "\"clients\":" + String(WiFi.softAPgetStationNum()) + ",";
  json += "\"maxClients\":" + String(AP_MAX_CLIENTS) + ",";
  json += "\"currentTime\":\"" + getFormattedDateTime() + "\",";
  json += "\"timeSynced\":" + String(isTimeSynced ? "true" : "false") + ",";
  json += "\"timeApprox\":" + String(isTimeApprox ? "true" : "false");
  json += "}";
  server.send(200, "application/json", json);
}

// หน้าเว็บส่งเวลาของเครื่องที่เปิดดู (epoch UTC) มาตั้งให้ Host แทนการใช้ NTP
void handleTimeSet() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  if (!server.hasArg("epoch")) {
    server.send(400, "text/plain", "Missing epoch");
    return;
  }
  uint32_t epoch = (uint32_t)strtoul(server.arg("epoch").c_str(), NULL, 10);
  if (epoch < 1600000000UL) {
    server.send(400, "text/plain", "Bad epoch");
    return;
  }
  struct timeval tv = { (time_t)epoch, 0 };
  settimeofday(&tv, NULL);
  isTimeSynced = true;
  isTimeApprox = false;
  backupClockToNvs();
  lastTimeBackup = millis();
  server.send(200, "text/plain", getFormattedDateTime().c_str());
}

const char PAGE_INDEX[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="th">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Smart IV Alert System v4.6.0</title>
  <style>
    :root {
      --primary: #0072ff;
      --primary-gradient: linear-gradient(135deg, #0072ff 0%, #00c6ff 100%);
      --bg-color: #f0f4f9;
      --card-bg: #ffffff;
      --text-main: #2d3748;
      --text-muted: #718096;
      --border-color: #e2e8f0;
      --green-bg: #e6fffa;
      --green-text: #234e52;
      --alarm-red: #fff5f5;
    }
    * { box-sizing: border-box; margin: 0; padding: 0; font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, "Sarabun", sans-serif; }
    body { background-color: var(--bg-color); color: var(--text-main); padding-bottom: 35px; }

    .header {
      background: var(--primary-gradient);
      color: white;
      padding: 16px 22px;
      box-shadow: 0 4px 12px rgba(0, 114, 255, 0.25);
      display: flex;
      justify-content: space-between;
      align-items: center;
      flex-wrap: wrap;
      gap: 10px;
    }
    .header-title { font-size: 20px; font-weight: 800; display: flex; align-items: center; }
    .header-badge { font-size: 12px; background: rgba(255,255,255,0.25); padding: 3px 9px; border-radius: 6px; margin-left: 8px; }
    .header-subtitle { font-size: 13.5px; opacity: 0.9; margin-top: 3px; display:flex; gap:12px; align-items:center; }
    .host-bat-badge {
      background: rgba(0,0,0,0.2);
      border: 1px solid rgba(255,255,255,0.3);
      padding: 5px 12px;
      border-radius: 8px;
      font-size: 13.5px;
      font-weight: 700;
      display: flex;
      align-items: center;
      gap: 4px;
    }
    .wifi-btn {
      background: rgba(255,255,255,0.25);
      border: 1px solid rgba(255,255,255,0.4);
      color: white;
      padding: 9px 14px;
      border-radius: 10px;
      cursor: pointer;
      font-size: 14.5px;
      font-weight: 600;
    }

    .main-nav {
      background: #ffffff;
      display: flex;
      justify-content: center;
      gap: 10px;
      padding: 12px 16px;
      border-bottom: 1px solid var(--border-color);
      box-shadow: 0 2px 5px rgba(0,0,0,0.02);
      position: sticky;
      top: 0;
      z-index: 100;
      flex-wrap: wrap;
    }
    .nav-btn {
      padding: 10px 18px;
      border-radius: 12px;
      border: none;
      background: #f7fafc;
      color: #4a5568;
      font-weight: 700;
      font-size: 15px;
      cursor: pointer;
      display: flex;
      align-items: center;
      gap: 6px;
      transition: all 0.2s;
    }
    .nav-btn.active {
      background: var(--primary);
      color: white;
      box-shadow: 0 4px 10px rgba(0, 114, 255, 0.3);
    }

    .main-wrap { max-width: 1350px; margin: 22px auto; padding: 0 16px; }
    .tab-content { display: none; }
    .tab-content.active { display: block; }

    .station-control-bar {
      background: #ffffff;
      padding: 14px 20px;
      border-radius: 14px;
      margin-bottom: 20px;
      border: 1px solid var(--border-color);
      display: flex;
      justify-content: space-between;
      align-items: center;
      flex-wrap: wrap;
      gap: 12px;
    }
    .scale-btn-group { display: flex; align-items: center; gap: 8px; }
    .scale-btn {
      background: #edf2f7;
      border: 1px solid var(--border-color);
      padding: 8px 16px;
      border-radius: 10px;
      cursor: pointer;
      font-weight: 700;
      font-size: 14.5px;
      color: #2d3748;
      transition: all 0.2s;
    }
    .scale-btn:hover { background: #e2e8f0; }

    .station-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(260px, 1fr));
      gap: 16px;
      margin-bottom: 26px;
    }
    .station-card {
      background: var(--card-bg);
      border-radius: 16px;
      padding: 18px;
      box-shadow: 0 4px 12px rgba(0,0,0,0.05);
      border: 2px solid transparent;
      transition: all 0.2s;
      cursor: pointer;
    }
    .station-card:hover { transform: translateY(-2px); }
    .station-card.selected {
      border-color: var(--primary);
      box-shadow: 0 6px 16px rgba(0, 114, 255, 0.2);
      background: #f8fbff;
    }
    .station-card.paused-state {
      border-color: #f59e0b !important;
      background: #fffbeb !important;
    }
    .station-card.alarm-state {
      background: var(--alarm-red) !important;
      border-color: #e53e3e !important;
      animation: pulseAlert 1.5s infinite;
    }
    @keyframes pulseAlert {
      0% { box-shadow: 0 0 0 0 rgba(229, 62, 62, 0.4); }
      70% { box-shadow: 0 0 0 10px rgba(229, 62, 62, 0); }
      100% { box-shadow: 0 0 0 0 rgba(229, 62, 62, 0); }
    }

    .station-header { display: flex; justify-content: space-between; align-items: flex-start; margin-bottom: 10px; }
    .station-title { font-weight: 800; font-size: 17px; display: flex; align-items: center; gap: 5px; color: #1a202c; }
    .patient-label { font-size: 14.5px; font-weight: 600; color: var(--primary); margin-top: 3px; white-space: nowrap; overflow: hidden; text-overflow: ellipsis; max-width: 170px; }

