kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
    .badge-status { font-size: 11.5px; padding: 4px 9px; border-radius: 20px; font-weight: 700; }
    .badge-online { background: #c6f6d5; color: #22543d; }
    .badge-offline { background: #fed7d7; color: #742a2a; }
    .badge-paused { background: #fef3c7; color: #92400e; border: 1px solid #f59e0b; }
    .badge-alarm { background: #e53e3e; color: white; }

    .telemetry-row {
      display: flex;
      align-items: center;
      justify-content: space-between;
      background: #f7fafc;
      padding: 7px 12px;
      border-radius: 8px;
      margin-bottom: 11px;
      font-size: 12px;
    }
    .signal-bars { display: flex; align-items: flex-end; gap: 2px; height: 13px; }
    .signal-bars .bar { width: 4px; background: #e2e8f0; border-radius: 1px; }
    .signal-bars .b1 { height: 25%; }
    .signal-bars .b2 { height: 50%; }
    .signal-bars .b3 { height: 75%; }
    .signal-bars .b4 { height: 100%; }

    .signal-bars.lvl-4 .b1, .signal-bars.lvl-4 .b2, .signal-bars.lvl-4 .b3, .signal-bars.lvl-4 .b4 { background: #38a169; }
    .signal-bars.lvl-3 .b1, .signal-bars.lvl-3 .b2, .signal-bars.lvl-3 .b3 { background: #3182ce; }
    .signal-bars.lvl-2 .b1, .signal-bars.lvl-2 .b2 { background: #dd6b20; }
    .signal-bars.lvl-1 .b1 { background: #e53e3e; }

    .stat-row { display: flex; justify-content: space-between; margin-bottom: 6px; font-size: 14px; }
    .stat-row .val { font-weight: 700; color: #1a202c; }

    .compare-box {
      background: #edf2f7;
      border-radius: 8px;
      padding: 7px 10px;
      margin-top: 9px;
      font-size: 12px;
      display: flex;
      justify-content: space-between;
    }

    .calc-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(330px, 1fr));
      gap: 22px;
      margin-bottom: 26px;
    }
    .card {
      background: var(--card-bg);
      border-radius: 16px;
      padding: 22px;
      box-shadow: 0 4px 15px rgba(0, 0, 0, 0.05);
      border: 1px solid var(--border-color);
      margin-bottom: 22px;
    }
    .card-title { font-size: 18px; font-weight: 700; margin-bottom: 18px; display: flex; justify-content: space-between; align-items: center; }
    .form-group { margin-bottom: 16px; }
    .form-group label { display: block; font-size: 14.5px; font-weight: 600; margin-bottom: 7px; color: var(--text-muted); }
    .input-field {
      width: 100%;
      padding: 11px 15px;
      border-radius: 10px;
      border: 1px solid var(--border-color);
      font-size: 16.5px;
      background: #fafafa;
      outline: none;
    }
    .pill-group { display: flex; gap: 8px; flex-wrap: wrap; margin-bottom: 15px; }
    .pill-btn {
      flex: 1;
      min-width: 55px;
      padding: 9px 13px;
      border-radius: 10px;
      border: 1px solid var(--border-color);
      background: #fff;
      cursor: pointer;
      font-weight: 600;
      font-size: 14.5px;
      text-align: center;
    }
    .pill-btn.active { background: var(--primary); color: #fff; border-color: var(--primary); }

    .btn-group { display: flex; gap: 11px; margin-top: 18px; }
    .btn {
      flex: 1;
      padding: 13px;
      border-radius: 12px;
      font-size: 15.5px;
      font-weight: 600;
      border: none;
      cursor: pointer;
      display: flex;
      align-items: center;
      justify-content: center;
      gap: 6px;
    }
    .btn-primary { background: var(--primary); color: white; }
    .btn-secondary { background: #edf2f7; color: #4a5568; }
    .btn-green { background: #38a169; color: white; }
    .btn-orange { background: #dd6b20; color: white; }
    .btn-danger { background: #e53e3e; color: white; }
    .badge-warn { background: #feebc8; color: #7b341e; border: 1px solid #dd6b20; }
    .station-card.warn-state { border-color: #dd6b20 !important; background: #fffaf0 !important; }
    .progress-track { height: 7px; background: #e2e8f0; border-radius: 4px; overflow: hidden; margin: 4px 0 8px; }
    .progress-fill { height: 100%; background: linear-gradient(90deg, #0072ff, #00c6ff); }
    .ack-btn { margin-top: 10px; width: 100%; padding: 9px; border: 0; border-radius: 10px; background: #dd6b20; color: #fff; font-weight: 700; font-size: 14.5px; cursor: pointer; }
    .near-line { font-size: 12.5px; color: #9c4221; margin-top: 4px; }
    .sync-note { font-size: 12.5px; color: var(--text-muted); margin-top: 10px; line-height: 1.5; }

    .result-grid { display: grid; grid-template-columns: 1fr 1fr; gap: 14px; margin-bottom: 15px; }
    .metric-card {
      background: #f7fafc;
      border: 1px solid var(--border-color);
      border-radius: 12px;
      padding: 14px;
      text-align: center;
    }
    .metric-card .title { font-size: 13.5px; color: var(--text-muted); }
    .metric-card .val { font-size: 24.5px; font-weight: 800; color: var(--primary); margin: 5px 0; }
    .metric-card .sub { font-size: 12px; color: #a0aec0; }

    .highlight-card {
      background: var(--green-bg);
      color: var(--green-text);
      border-radius: 12px;
      padding: 15px;
      margin-bottom: 14px;
      text-align: center;
    }
    .highlight-card .big-text { font-size: 20px; font-weight: 800; }
    .highlight-card .sub-text { font-size: 12px; }

    .chamber-box {
      height: 185px;
      background: #fff;
      border: 1px solid var(--border-color);
      border-radius: 14px;
      display: flex;
      flex-direction: column;
      align-items: center;
      position: relative;
      overflow: hidden;
      margin-top: 10px;
    }
    .iv-tube-top { width: 6px; height: 20px; background: #cbd5e0; }
    .iv-chamber { width: 40px; height: 80px; border: 2px solid #a0aec0; border-radius: 10px 10px 20px 20px; position: relative; }
    .iv-nozzle { width: 4px; height: 10px; background: #718096; margin: 0 auto; }
    .iv-pool { position: absolute; bottom: 0; width: 100%; height: 18px; background: #63b3ed; border-radius: 0 0 18px 18px; }
    .drop {
      width: 8px; height: 12px; background: #3182ce; border-radius: 50%; position: absolute; left: 16px; top: 12px; opacity: 0;
    }
    .drop.animate { animation: fall linear infinite; }
    @keyframes fall {
      0% { top: 12px; opacity: 1; }
      80% { top: 58px; opacity: 1; }
      100% { top: 62px; opacity: 0; }
    }
    .sim-status-text { font-size: 13.5px; color: var(--text-muted); margin-top: 9px; }

    .tab-bar {
      display: flex;
      gap: 9px;
      margin-bottom: 18px;
      overflow-x: auto;
      padding-bottom: 5px;
    }
    .tab-item {
      padding: 9px 18px;
      border-radius: 10px;
      background: #edf2f7;
      color: #4a5568;
      font-weight: 700;
      font-size: 14.5px;
      cursor: pointer;
      white-space: nowrap;
      transition: all 0.2s;
    }
    .tab-item.active { background: var(--primary); color: white; }

