kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
    .chart-container { position: relative; width: 100%; height: 290px; margin-bottom: 22px; }
    canvas { width: 100% !important; height: 100% !important; background: #fafcff; border-radius: 12px; border: 1px solid var(--border-color); }

    .table-container { max-height: 420px; overflow-y: auto; border: 1px solid var(--border-color); border-radius: 12px; }
    .log-table { width: 100%; border-collapse: collapse; font-size: 14.5px; text-align: left; }
    .log-table th { background: #f8fafc; color: #4a5568; font-weight: 700; padding: 13px 15px; position: sticky; top: 0; border-bottom: 2px solid var(--border-color); }
    .log-table td { padding: 11px 15px; border-bottom: 1px solid var(--border-color); color: #2d3748; }
    .log-table tr:hover { background: #f7fafc; }

    /* แท็บ About & Research Team */
    .about-header-box {
      background: #ffffff;
      padding: 24px;
      border-radius: 16px;
      border: 1px solid var(--border-color);
      margin-bottom: 20px;
    }
    .about-header-box h2 { font-size: 20px; color: var(--text-main); margin-bottom: 10px; }
    .about-header-box p { color: var(--text-muted); font-size: 14.5px; line-height: 1.6; }
    
    .team-grid {
      display: grid;
      grid-template-columns: 2fr 1fr;
      gap: 20px;
      margin-bottom: 20px;
    }
    @media (max-width: 900px) {
      .team-grid { grid-template-columns: 1fr; }
    }
    .team-card {
      background: #ffffff;
      border-radius: 14px;
      padding: 22px;
      border: 1px solid var(--border-color);
      box-shadow: 0 4px 10px rgba(0,0,0,0.02);
    }
    .team-card-title { font-size: 17px; font-weight: 800; color: var(--primary); margin-bottom: 14px; display: flex; align-items: center; gap: 6px; }
    
    .unified-member-grid {
      display: grid;
      grid-template-columns: 1fr 1fr;
      gap: 8px 16px;
    }
    @media (max-width: 600px) {
      .unified-member-grid { grid-template-columns: 1fr; }
    }
    .member-item {
      padding: 8px 0;
      border-bottom: 1px dashed #edf2f7;
      font-size: 14px;
      display: flex;
      justify-content: space-between;
      align-items: center;
    }
    .member-item .sid { color: var(--text-muted); font-size: 12.5px; font-family: monospace; }

    .modal { display: none; position: fixed; top: 0; left: 0; width: 100%; height: 100%; background: rgba(0,0,0,0.5); z-index: 999; justify-content: center; align-items: center; }
    .modal-content { background: white; width: 90%; max-width: 440px; padding: 26px; border-radius: 16px; font-size: 14.5px; }
  </style>
</head>
<body>

  <div class="header">
    <div>
      <h1 class="header-title">
        🏥 Smart IV Alert Central System
        <span class="header-badge">v4.6.0</span>
      </h1>
      <div class="header-subtitle">
        <span id="netStatusSubtitle">AP: 192.168.4.1 · กำลังตรวจสอบ...</span>
        <span>🕒 เวลา: <b id="hostClockDisplay">กำลังซิงก์...</b></span>
      </div>
    </div>
    <div style="display:flex; gap:9px; align-items:center;">
      <div class="host-bat-badge" id="hostBatDisplay">🔋 Host: 100%</div>
      <button class="wifi-btn" id="audioToggleBtn" onclick="toggleAudioMute()">🔔 เปิดเสียงเตือน</button>
      <button class="wifi-btn" onclick="openApModal()">📶 จุดเชื่อมต่อ</button>
    </div>
  </div>

  <div class="main-nav">
    <button class="nav-btn active" onclick="switchMainTab('tab-live', this)">🛏️ Live Monitor</button>
    <button class="nav-btn" onclick="switchMainTab('tab-graphs', this)">📈 Visual Graphs (1 ชม.)</button>
    <button class="nav-btn" onclick="switchMainTab('tab-logs', this)">📋 Log & Shift Report</button>
    <button class="nav-btn" onclick="switchMainTab('tab-about', this)">👥 เกี่ยวกับงานวิจัย & คณะผู้จัดทำ</button>
  </div>

  <div class="main-wrap">
    <div id="tab-live" class="tab-content active">
      <div class="station-control-bar">
        <span style="font-weight:700; font-size:16.5px; color:#2d3748;">
          🛏️ สถานะภาพรวมสารน้ำ (<span id="activeBedCountLabel">5</span> เตียง)
        </span>
        <div class="scale-btn-group">
          <span style="font-size:14px; color:var(--text-muted); margin-right:4px;">ปรับจำนวนเตียง:</span>
          <button class="scale-btn" onclick="changeBedScale(-1)">➖ ลดเตียง</button>
          <button class="scale-btn" onclick="changeBedScale(1)" style="background:var(--primary); color:#fff; border-color:var(--primary);">➕ เพิ่มเตียง</button>
        </div>
      </div>

      <div class="station-grid" id="stationGridContainer"></div>

      <div style="background:#ffffff; padding:16px 20px; border-radius:14px; margin-bottom:22px; border:1px solid var(--border-color); display:flex; align-items:center; justify-content:space-between; flex-wrap:wrap; gap:12px;">
        <span style="font-weight:700; font-size:15.5px; color:#2d3748;">
          ⚙️ เลือกเตียงที่ต้องการตั้งค่า: <span style="color:var(--primary); font-size:17.5px;" id="activeBedBadgeText">เตียง 1</span>
        </span>
        <div class="tab-bar" style="margin-bottom:0; padding-bottom:0;" id="calcBedSelectorTabs"></div>
      </div>

      <div class="calc-grid">
        <div class="card">
          <div class="card-title">
            <span>📝 ข้อมูลผู้ป่วย & คำนวณอัตราหยด</span>
            <span style="font-size:13.5px; color:var(--primary);" id="cardBedTag1">[เตียง 1]</span>
          </div>
          <div class="form-group">
            <label>👤 ชื่อ-นามสกุล คนไข้ / หมายเหตุ</label>
            <input type="text" id="patientNameInput" class="input-field" value="" placeholder="เช่น นายสมชาย ใจดี" oninput="onPatientNameChanged(this.value)" style="border-color:#cbd5e0; font-weight:600;">
          </div>
          <div class="form-group">
            <label>ปริมาตรสารน้ำ (mL)</label>
            <input type="number" id="volumeInput" class="input-field" value="1000" oninput="onInputChanged()">
          </div>
          <div class="form-group">
            <label>เวลาให้สารน้ำ (ชั่วโมง)</label>
            <input type="number" step="0.1" id="hoursInput" class="input-field" value="12.5" oninput="onInputChanged()">
          </div>
          <div class="form-group">
            <label>Drop Factor (gtt/mL)</label>
            <div class="pill-group">
              <button class="pill-btn" onclick="setDropFactor(10, this)">10</button>
              <button class="pill-btn" onclick="setDropFactor(15, this)">15</button>
              <button class="pill-btn active" onclick="setDropFactor(20, this)">20</button>
              <button class="pill-btn" onclick="setDropFactor(60, this)">60</button>
            </div>
          </div>
          <div class="form-group">
            <label>เวลาเริ่มให้สารน้ำ</label>
            <input type="time" id="startTimeInput" class="input-field" value="10:00" onchange="onInputChanged()">
          </div>
          <div class="btn-group">
            <button class="btn btn-primary" onclick="calculateIVRate(true)">🧮 บันทึก & ส่งไป Host</button>
            <button class="btn btn-danger" onclick="resetBedCounter()">🔄 เริ่มถุงใหม่</button>
          </div>
          <div class="sync-note" id="hostCfgNote">ค่าที่ Host ใช้อยู่: -</div>
          <div class="sync-note" id="dirtyNote" style="color:#dd6b20; font-weight:600;"></div>
        </div>

        <div class="card">
          <div class="card-title">
            <span>⏰ คำนวณเวลาที่ IV หมด</span>
            <span style="font-size:13.5px; color:var(--primary);" id="cardBedTag2">[เตียง 1]</span>
          </div>
          <div class="form-group">
            <label>ปริมาณสารน้ำทั้งหมด (mL)</label>
            <input type="number" id="volTotalInput" class="input-field" value="1000" oninput="onInputChanged()">
          </div>
          <div class="form-group">
            <label>Rate ตามออเดอร์ (mL/hr)</label>
            <input type="number" id="orderRateInput" class="input-field" value="80" oninput="onInputChanged()">
          </div>
          <div class="form-group">
            <label>แจ้งเตือนใกล้หมด เมื่อให้ไปแล้ว (% ของปริมาตรตามแผน)</label>
            <input type="number" id="nearPctInput" class="input-field" value="80" min="50" max="95" step="5" oninput="onInputChanged()">
            <div class="near-line" id="nearPctHint">จะเตือนเมื่อให้ไปแล้ว 800 mL</div>
          </div>
          <div class="form-group">
            <label>เริ่มให้เวลา</label>
            <input type="time" id="startTime2Input" class="input-field" value="10:10" onchange="onInputChanged()">
          </div>
          <div class="btn-group">
            <button class="btn btn-primary" onclick="calculateEndTime(true)">🧮 บันทึก Rate & ส่งไป Host</button>
          </div>
          <div style="margin-top: 15px;">
            <div class="highlight-card">
              <div class="sub-text">สารน้ำจะหมดใน</div>
              <div class="big-text" id="durationText">12 ชั่วโมง 30 นาที</div>
              <div style="font-size: 14.5px; font-weight: bold; margin-top: 5px;" id="endTime2Text">หมดเวลา 22:40 น.</div>
            </div>
          </div>
        </div>

        <div class="card">
          <div class="card-title" id="simTitle">💧 จำลองการหยด: Bed / Station 1</div>
          <div class="result-grid">
            <div class="metric-card">
              <div class="title">เป้าหมาย (Target)</div>
              <div class="val" id="gttMinDisplay">26.67</div>
              <div class="sub">gtt/min</div>
            </div>
            <div class="metric-card">
              <div class="title">เวลา/หยด</div>
              <div class="val" id="secPerDropDisplay">2.25</div>
              <div class="sub">วินาที/หยด</div>
            </div>
          </div>
          <div class="chamber-box">
            <div class="iv-tube-top"></div>
            <div class="iv-chamber">
              <div class="iv-nozzle"></div>
              <div class="drop" id="dropElement"></div>
              <div class="iv-pool"></div>
            </div>
            <div class="sim-status-text" id="simStatus">สถานะ: จำลองตามค่าคำนวณ</div>
          </div>
          <div class="btn-group">
            <button class="btn btn-green" onclick="startDrip()">▶️ เริ่มจำลอง</button>
            <button class="btn btn-orange" onclick="stopDrip()">⏸️ หยุด</button>
          </div>
        </div>
      </div>
    </div>

    <div id="tab-graphs" class="tab-content">
      <div class="card">
        <div class="card-title">
          <span>📈 กราฟวิเคราะห์แนวโน้มย้อนหลัง 60 นาที (Offline Native Canvas)</span>
          <span style="font-size: 13.5px; font-weight: normal; color: var(--text-muted);">อัปเดตอัตโนมัติ</span>
        </div>
        <div class="tab-bar" id="graphBedSelectorTabs"></div>
        <div class="result-grid" style="grid-template-columns: repeat(auto-fit, minmax(140px, 1fr)); margin-bottom: 18px;">
          <div class="metric-card"><div class="title">Peak Rate</div><div class="val" style="color:#e53e3e;" id="graphPeakRate">0.0</div><div class="sub">mL/hr</div></div>
          <div class="metric-card"><div class="title">Min Rate</div><div class="val" style="color:#3182ce;" id="graphMinRate">0.0</div><div class="sub">mL/hr</div></div>
          <div class="metric-card"><div class="title">Avg Rate</div><div class="val" style="color:#2f855a;" id="graphAvgRate">0.0</div><div class="sub">mL/hr</div></div>
          <div class="metric-card"><div class="title">Total (1 ชม.)</div><div class="val" style="color:#805ad5;" id="graphTotalVol">0.00</div><div class="sub">mL</div></div>
        </div>
        <h3 style="font-size:15.5px; margin-bottom:10px; color:#4a5568; font-weight:700;">⚡ อัตราการไหลสารน้ำ Flow Rate (mL/hr)</h3>
        <div class="chart-container"><canvas id="flowRateCanvas"></canvas></div>
        <h3 style="font-size:15.5px; margin-bottom:10px; color:#4a5568; font-weight:700;">💧 ปริมาณหยดน้ำต่อนาที Drops (drops/min)</h3>
        <div class="chart-container"><canvas id="dropsCanvas"></canvas></div>
      </div>
    </div>

    <div id="tab-logs" class="tab-content">
      <div class="card">
        <div class="card-title">
          <span>📋 ตารางประวัติ 60 นาที & รายงานส่งเวร (Shift Report พร้อมเวลาจริง)</span>
          <button class="btn btn-primary" style="width:auto; padding:9px 18px; font-size:14.5px;" onclick="downloadShiftCSV()">📥 ดาวน์โหลด CSV</button>
        </div>
        <div class="tab-bar" id="logBedSelectorTabs"></div>
        <div class="result-grid" style="grid-template-columns: repeat(auto-fit, minmax(190px, 1fr)); margin-bottom: 15px;">
          <div class="metric-card"><div class="title">หยดรวมใน 60 นาที</div><div class="val" id="logSumDrops">0</div><div class="sub">drops</div></div>
          <div class="metric-card"><div class="title">ปริมาตรรวมใน 60 นาที</div><div class="val" id="logSumVolume">0.00</div><div class="sub">mL</div></div>
          <div class="metric-card"><div class="title">Flow Rate เฉลี่ย</div><div class="val" id="logAvgRate">0.00</div><div class="sub">mL/hr</div></div>
        </div>
        <div class="table-container">
          <table class="log-table">
            <thead>
              <tr>
                <th>ลำดับ</th>
                <th>วัน-เวลาบันทึก (Timestamp)</th>
                <th>หยดในนาทีนั้น</th>
                <th>ปริมาตรรวมสะสม</th>
                <th>Rate เฉลี่ย</th>
                <th>Target</th>
                <th>สถานะแจ้งเตือน</th>
                <th>สัญญาณ (RSSI)</th>
                <th>แบตเตอรี่เตียง</th>
              </tr>
            </thead>
            <tbody id="logTableBody">
              <tr><td colspan="9" style="text-align: center; color: var(--text-muted); padding: 22px;">กำลังรวบรวมข้อมูล...</td></tr>
            </tbody>
          </table>
        </div>
      </div>
    </div>

