kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
    <div id="tab-about" class="tab-content">
      <div class="about-header-box">
        <h2>🏥 โครงการวิจัย: ผลของการใช้นวัตกรรม Smart IV Alert ต่อความแม่นยำในการแจ้งเตือนและปริมาณสารน้ำที่ได้รับ</h2>
        <p>
          <b>พื้นที่ศึกษา:</b> หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น อำเภอสูงเม่น จังหวัดแพร่<br>
          <b>ระยะเวลาดำเนินการ:</b> 12 สัปดาห์ (มิถุนายน – กันยายน พ.ศ. 2569)<br>
          <b>สถาบัน:</b> วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
        </p>
      </div>

      <div class="team-grid">
        <div class="team-card">
          <div class="team-card-title">👩‍⚕️ คณะผู้จัดทำงานวิจัย (นักศึกษาพยาบาลศาสตร์)</div>
          <div class="unified-member-grid">
            <div class="member-item"><span>1. น.ส.นภารัตน์ กุลแก้ว (หัวหน้าโครงการ)</span><span class="sid">67130301040</span></div>
            <div class="member-item"><span>2. น.ส.จิราวรรณ ศรีสถาน</span><span class="sid">67130301015</span></div>
            <div class="member-item"><span>3. น.ส.ชญาดา สมศรีษะ</span><span class="sid">67130301019</span></div>
            <div class="member-item"><span>4. น.ส.ชนิสรา แก้วใส</span><span class="sid">67130301022</span></div>
            <div class="member-item"><span>5. น.ส.ชลธาร ฮาดดา</span><span class="sid">67130301024</span></div>
            <div class="member-item"><span>6. น.ส.นริสรา เครือคำมูล</span><span class="sid">67130301041</span></div>
            <div class="member-item"><span>7. น.ส.ปริยากร เจริญสุข</span><span class="sid">67130301046</span></div>
            <div class="member-item"><span>8. น.ส.ปิติพร เหล็กแจ้ง</span><span class="sid">67130301049</span></div>
            <div class="member-item"><span>9. น.ส.พิริสา แก้วกู่</span><span class="sid">67130301061</span></div>
            <div class="member-item"><span>10. น.ส.วรัญญา ผามารถเมือง</span><span class="sid">67130301077</span></div>
            <div class="member-item"><span>11. น.ส.อมรลดา นาขาม</span><span class="sid">67130301106</span></div>
            <div class="member-item"><span>12. น.ส.อารีรัตน์ จิตต์อารีย์</span><span class="sid">67130301110</span></div>
          </div>
        </div>

        <div class="team-card">
          <div class="team-card-title">🎓 อาจารย์ที่ปรึกษา & ฝ่ายวิศวกรรม</div>
          <div style="font-size:14px; line-height:1.7; color:#2d3748;">
            <b>อาจารย์ที่ปรึกษาโครงการวิจัย:</b><br>
            • <b>ดร.กรรณิการ์ กาศสมบูรณ์</b><br>
            <span style="color:var(--text-muted); font-size:12.5px;">รองผู้อำนวยการฝ่ายกิจการนักศึกษา<br>วิทยาลัยพยาบาลบรมราชชนนี แพร่</span>
            <hr style="border:0; border-top:1px dashed var(--border-color); margin:12px 0;">
            <b>ฝ่ายพัฒนาระบบวิศวกรรม & โครงข่าย IoT:</b><br>
            • <b>นายกิตติพันธ์ รัตนคร</b> (นักวิชาการคอมพิวเตอร์)<br>
            <span style="color:var(--text-muted); font-size:12.5px;">มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตแพร่</span>
          </div>
        </div>
      </div>
    </div>
  </div>

  <div class="modal" id="apModal">
    <div class="modal-content">
      <h3 style="margin-bottom: 14px; font-size:17.5px;">📶 จุดเชื่อมต่อของเครื่อง Host</h3>
      <div style="margin-bottom: 15px; background:#f7fafc; padding:12px; border-radius:10px; font-size:14.5px;" id="apDetailBox">กำลังโหลด...</div>
      <div style="background:#fffaf0; border-left:4px solid #dd6b20; padding:11px 13px; border-radius:8px; font-size:13.5px; line-height:1.65;">
        เครื่องนี้ทำงานเป็นจุดเชื่อมต่อในตัว <b>ไม่ต้องต่อ Wi-Fi ของโรงพยาบาลหรืออินเทอร์เน็ต</b><br>
        ให้มือถือ/แท็บเล็ตเชื่อมต่อ Wi-Fi ชื่อข้างบน แล้วเปิด <b>http://192.168.4.1</b><br>
        หากมือถือแจ้งว่า "ไม่มีอินเทอร์เน็ต" ให้เลือก <b>ใช้งานต่อ / ยังคงเชื่อมต่อ</b>
      </div>
      <div class="btn-group" style="margin-top:14px;"><button class="btn btn-secondary" onclick="closeApModal()">ปิด</button></div>
    </div>
  </div>

  <script>
    let activeBedCount = 5;
    let maxSupportedBeds = 8;

    const generateDefaultConfigs = () => {
      const arr = [];
      for (let i = 1; i <= maxSupportedBeds; i++) {
        arr.push({
          id: i,
          patientName: '',
          volume: 1000,
          hours: 12.5,
          dropFactor: 20,
          startTime: "10:00",
          volTotal: 1000,
          orderRate: 80,
          startTime2: "10:10",
          gttMin: 26.67,
          secPerDrop: 2.25,
          durationText: "12 ชั่วโมง 30 นาที",
          endTime2Text: "หมดเวลา 22:40 น.",
          nearPct: 80
        });
      }
      return arr;
    };

    let bedConfigs = JSON.parse(localStorage.getItem('iv_bed_configs_v460')) || generateDefaultConfigs();
    function saveBedConfigs() { localStorage.setItem('iv_bed_configs_v460', JSON.stringify(bedConfigs)); }

    let selectedStation = 1;
    let activeLogTab = 1;
    let activeGraphStation = 1;
    let audioMuted = true;
    let audioCtx = null;
    let nameSyncTimer = null;
    let skipHostSyncUntil = 0;
    let lastHostData = null;
    const dirtyBeds = new Set();   // เตียงที่แก้ค่าในฟอร์มแต่ยังไม่ได้ส่งไป Host

    function updateNearPctHint() {
      const cfg = bedConfigs[selectedStation - 1];
      const el = document.getElementById('nearPctHint');
      if (!el || !cfg) return;
      const pct = cfg.nearPct || 80;
      el.innerText = cfg.volTotal > 0
        ? `จะเตือนเมื่อให้ไปแล้ว ${Math.round(cfg.volTotal * pct / 100)} mL (เหลือ ${Math.round(cfg.volTotal * (100 - pct) / 100)} mL)` +
          (cfg.orderRate > 0 ? ` ประมาณ ${Math.round(cfg.volTotal * (100 - pct) / 100 / cfg.orderRate * 60)} นาทีก่อนหมด` : '')
        : 'ยังไม่ได้ตั้งปริมาตรตามแผน';
    }

    function acknowledgeNearEnd(id, ev) {
      if (ev) ev.stopPropagation();
      fetch('/api/stations/ack', {
        method: 'POST',
        headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
        body: `station=${id}`
      }).catch(e => alert('ส่งการรับทราบไม่สำเร็จ: ' + e.message));
    }

    function playNearEndChime() {
      if (audioMuted) return;
      try {
        if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
        [0, 0.25, 0.5].forEach(t => {
          const osc = audioCtx.createOscillator(), gain = audioCtx.createGain();
          osc.frequency.value = 1046;
          gain.gain.setValueAtTime(0.15, audioCtx.currentTime + t);
          gain.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime + t + 0.18);
          osc.connect(gain); gain.connect(audioCtx.destination);
          osc.start(audioCtx.currentTime + t); osc.stop(audioCtx.currentTime + t + 0.2);
        });
      } catch (e) { console.log(e); }
    }
    const nearChimed = {};

    function updateDirtyNote() {
      const el = document.getElementById('dirtyNote');
      if (el) el.innerText = dirtyBeds.has(selectedStation) ? '⚠️ มีค่าที่แก้ไขแต่ยังไม่ได้ส่งไป Host — กดปุ่ม "บันทึก ... ส่งไป Host"' : '';
    }

