kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
    const ALERT_META = {
      0: { text: '● ปกติ',               cls: 'badge-online', card: '',            alarm: false },
      1: { text: '⚠️ ไหลเร็วเกิน',        cls: 'badge-alarm',  card: 'alarm-state', alarm: true  },
      2: { text: '⚠️ ไหลช้าเกิน',         cls: 'badge-alarm',  card: 'alarm-state', alarm: true  },
      3: { text: '⏳ ใกล้หมด เตรียมถุงใหม่', cls: 'badge-warn',   card: 'warn-state',  alarm: false },
      4: { text: '🛑 ให้ครบตามแผนแล้ว',   cls: 'badge-alarm',  card: 'alarm-state', alarm: true  },
      5: { text: '⚠️ สายพับ/หยุดไหล',     cls: 'badge-alarm',  card: 'alarm-state', alarm: true  }
    };

    function escapeHtml(str) {
      return String(str ?? '').replace(/[&<>"']/g, c => ({ '&': '&amp;', '<': '&lt;', '>': '&gt;', '"': '&quot;', "'": '&#39;' }[c]));
    }

    function recalcDerived(cfg) {
      cfg.gttMin = cfg.orderRate > 0 ? (cfg.orderRate * cfg.dropFactor) / 60 : 0;
      cfg.secPerDrop = cfg.gttMin > 0 ? (60 / cfg.gttMin) : 0;
    }

    function pushBedConfig(id, showAlert = false) {
      const cfg = bedConfigs[id - 1];
      skipHostSyncUntil = Date.now() + 3000;
      const body = new URLSearchParams({
        station: id,
        rate: (cfg.orderRate || 0).toFixed(1),
        volume: (cfg.volTotal || 0).toFixed(0),
        df: cfg.dropFactor,
        nearpct: cfg.nearPct || 80,
        name: cfg.patientName || ''
      });
      return fetch('/api/stations/config', {
        method: 'POST',
        headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
        body: body.toString()
      }).then(r => {
        if (!r.ok) return r.text().then(t => { throw new Error(t || ('HTTP ' + r.status)); });
        dirtyBeds.delete(id);
        updateDirtyNote();
        if (showAlert) alert(`ส่งค่าเตียง ${id} ไปยัง Host เรียบร้อยแล้ว\nRate ${cfg.orderRate.toFixed(1)} mL/hr | แผน ${cfg.volTotal} mL | ${cfg.dropFactor} gtt/mL\nเตือนใกล้หมดที่ ${cfg.nearPct || 80}%`);
      }).catch(e => alert('ส่งค่าไปยัง Host ไม่สำเร็จ: ' + e.message));
    }

    function resetBedCounter() {
      const id = selectedStation;
      if (!confirm(`เริ่มถุงใหม่สำหรับเตียง ${id}?\n\nระบบจะรีเซ็ตจำนวนหยด ปริมาตรสะสม และประวัติ 60 นาทีของเตียงนี้ ทั้งที่ Host และเครื่องประจำเตียง`)) return;
      fetch('/api/stations/reset', {
        method: 'POST',
        headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
        body: `station=${id}`
      }).then(r => {
        if (!r.ok) throw new Error('HTTP ' + r.status);
        alert(`รีเซ็ตเตียง ${id} แล้ว (เครื่องประจำเตียงจะรีเซ็ตภายใน 1-2 วินาที)`);
        if (document.getElementById('tab-logs').classList.contains('active')) fetchLogs();
      }).catch(e => alert('รีเซ็ตไม่สำเร็จ: ' + e.message));
    }

    // Host เป็นแหล่งข้อมูลหลักของ Rate / แผน / Drop factor / ชื่อผู้ป่วย
    function syncConfigsFromHost(stationsData) {
      if (Date.now() < skipHostSyncUntil) return;
      const ae = document.activeElement;
      const editing = ae && (ae.tagName === 'INPUT' || ae.tagName === 'SELECT');
      let needTabs = false;
      stationsData.forEach(st => {
        const cfg = bedConfigs[st.id - 1];
        if (!cfg) return;
        if (editing && st.id === selectedStation) return;
        if (dirtyBeds.has(st.id)) return;
        let changed = false;
        if (Math.abs((cfg.orderRate || 0) - st.targetRate) > 0.05) { cfg.orderRate = st.targetRate; changed = true; }
        if (Math.abs((cfg.volTotal || 0) - st.planVolume) > 0.5) { cfg.volTotal = st.planVolume; changed = true; }
        if (cfg.dropFactor !== st.dropFactor) { cfg.dropFactor = st.dropFactor; changed = true; }
        if ((cfg.nearPct || 80) !== st.nearEndPct) { cfg.nearPct = st.nearEndPct; changed = true; }
        if ((cfg.patientName || '') !== (st.patientName || '')) { cfg.patientName = st.patientName || ''; changed = true; needTabs = true; }
        if (changed) {
          recalcDerived(cfg);
          if (st.id === selectedStation) loadBedToForm(selectedStation);
        }
      });
      if (needTabs) renderTabs();
      saveBedConfigs();
    }

    function updateHostCfgNote() {
      const el = document.getElementById('hostCfgNote');
      if (!el || !lastHostData) return;
      const st = lastHostData.stations.find(x => x.id === selectedStation);
      if (!st) { el.innerText = 'ค่าที่ Host ใช้อยู่: -'; return; }
      el.innerHTML = `ค่าที่ Host ใช้อยู่ (เตียง ${st.id}): <b>${st.targetRate} mL/hr</b> | แผน <b>${st.planVolume} mL</b> | <b>${st.dropFactor} gtt/mL</b> | เตือนใกล้หมด <b>${st.nearEndPct}%</b>` +
                     (st.caseStart ? `<br>เริ่มถุงปัจจุบัน: ${escapeHtml(st.caseStart)}` : '');
    }

    function playAlarmTone() {
      if (audioMuted) return;
      try {
        if (!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
        const osc = audioCtx.createOscillator();
        const gain = audioCtx.createGain();
        osc.type = 'sine';
        osc.frequency.setValueAtTime(880, audioCtx.currentTime);
        gain.gain.setValueAtTime(0.3, audioCtx.currentTime);
        gain.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime + 0.5);
        osc.connect(gain);
        gain.connect(audioCtx.destination);
        osc.start();
        osc.stop(audioCtx.currentTime + 0.5);
      } catch (e) { console.log(e); }
    }

    function toggleAudioMute() {
      audioMuted = !audioMuted;
      document.getElementById('audioToggleBtn').innerText = audioMuted ? '🔕 ปิดเสียงเตือน' : '🔔 เปิดเสียงเตือน';
      if (!audioMuted && !audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
    }

    function switchMainTab(tabId, btnEl) {
      document.querySelectorAll('.tab-content').forEach(el => el.classList.remove('active'));
      document.querySelectorAll('.nav-btn').forEach(el => el.classList.remove('active'));
      document.getElementById(tabId).classList.add('active');
      btnEl.classList.add('active');

      if (tabId === 'tab-graphs') renderGraphs();
      else if (tabId === 'tab-logs') fetchLogs();
    }

    function changeBedScale(delta) {
      const newCount = activeBedCount + delta;
      if (newCount < 1 || newCount > maxSupportedBeds) {
        alert(`สามารถตั้งจำนวนเตียงได้ระหว่าง 1 ถึง ${maxSupportedBeds} เตียง`);
        return;
      }
      fetch(`/api/stations/set?count=${newCount}`, { method: 'POST' })
        .then(res => {
          if (res.ok) {
            activeBedCount = newCount;
            document.getElementById('activeBedCountLabel').innerText = activeBedCount;
            if (selectedStation > activeBedCount) selectedStation = 1;
            if (activeGraphStation > activeBedCount) activeGraphStation = 1;
            if (activeLogTab > activeBedCount) activeLogTab = 1;
            renderTabs();
            loadBedToForm(selectedStation);
          }
        });
    }

