kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
    function renderTabs() {
      const calcBox = document.getElementById('calcBedSelectorTabs');
      calcBox.innerHTML = '';
      for (let i = 0; i < activeBedCount; i++) {
        const b = bedConfigs[i];
        const isAct = (b.id === selectedStation) ? 'active' : '';
        calcBox.innerHTML += `<div class="tab-item ${isAct}" onclick="selectStation(${b.id})">🛏️ เตียง ${b.id}: ${escapeHtml(b.patientName) || 'ว่าง'}</div>`;
      }

      const graphBox = document.getElementById('graphBedSelectorTabs');
      graphBox.innerHTML = '';
      for (let i = 0; i < activeBedCount; i++) {
        const b = bedConfigs[i];
        const isAct = (b.id === activeGraphStation) ? 'active' : '';
        graphBox.innerHTML += `<div class="tab-item ${isAct}" onclick="switchGraphStation(${b.id}, this)">🛏️ เตียง ${b.id}: ${escapeHtml(b.patientName) || 'ว่าง'}</div>`;
      }

      const logBox = document.getElementById('logBedSelectorTabs');
      logBox.innerHTML = '';
      for (let i = 0; i < activeBedCount; i++) {
        const b = bedConfigs[i];
        const isAct = (b.id === activeLogTab) ? 'active' : '';
        logBox.innerHTML += `<div class="tab-item ${isAct}" onclick="switchLogTab(${b.id}, this)">🛏️ เตียง ${b.id}: ${escapeHtml(b.patientName) || 'ว่าง'}</div>`;
      }
    }

    function onPatientNameChanged(val) {
      bedConfigs[selectedStation - 1].patientName = val;
      saveBedConfigs();
      renderTabs();
      updateBedTitles();
      clearTimeout(nameSyncTimer);
      const sid = selectedStation;
      skipHostSyncUntil = Date.now() + 3000;
      nameSyncTimer = setTimeout(() => pushBedConfig(sid, false), 1000);
    }

    function updateBedTitles() {
      const cfg = bedConfigs[selectedStation - 1];
      const pName = cfg.patientName ? `(${cfg.patientName})` : '';
      document.getElementById('activeBedBadgeText').innerText = `เตียง ${selectedStation} ${pName}`;
      document.getElementById('cardBedTag1').innerText = `[เตียง ${selectedStation} ${pName}]`;
      document.getElementById('cardBedTag2').innerText = `[เตียง ${selectedStation} ${pName}]`;
      document.getElementById('simTitle').innerText = `💧 จำลองการหยด: เตียง ${selectedStation} ${pName}`;
    }

    function loadBedToForm(id) {
      const cfg = bedConfigs[id - 1];
      document.getElementById('patientNameInput').value = cfg.patientName || '';
      document.getElementById('volumeInput').value = cfg.volume;
      document.getElementById('hoursInput').value = cfg.hours;
      document.getElementById('startTimeInput').value = cfg.startTime;
      document.getElementById('volTotalInput').value = cfg.volTotal;
      document.getElementById('orderRateInput').value = cfg.orderRate;
      document.getElementById('startTime2Input').value = cfg.startTime2;
      document.getElementById('nearPctInput').value = cfg.nearPct || 80;
      updateNearPctHint();

      document.querySelectorAll('.pill-btn').forEach(btn => {
        if (parseInt(btn.innerText) === cfg.dropFactor) btn.classList.add('active');
        else btn.classList.remove('active');
      });

      document.getElementById('gttMinDisplay').innerText = cfg.gttMin.toFixed(2);
      document.getElementById('secPerDropDisplay').innerText = cfg.secPerDrop.toFixed(2);
      document.getElementById('durationText').innerText = cfg.durationText;
      document.getElementById('endTime2Text').innerText = cfg.endTime2Text;

      updateBedTitles();
      renderTabs();
      updateHostCfgNote();
      updateDirtyNote();

      if (document.getElementById('dropElement').classList.contains('animate')) startDrip();
    }

    function onInputChanged() {
      const cfg = bedConfigs[selectedStation - 1];
      cfg.volume = parseFloat(document.getElementById('volumeInput').value) || 0;
      cfg.hours = parseFloat(document.getElementById('hoursInput').value) || 0;
      cfg.startTime = document.getElementById('startTimeInput').value;
      cfg.volTotal = parseFloat(document.getElementById('volTotalInput').value) || 0;
      cfg.orderRate = parseFloat(document.getElementById('orderRateInput').value) || 0;
      cfg.startTime2 = document.getElementById('startTime2Input').value;
      cfg.nearPct = Math.min(95, Math.max(50, parseInt(document.getElementById('nearPctInput').value) || 80));
      updateNearPctHint();
      dirtyBeds.add(selectedStation);
      updateDirtyNote();
      saveBedConfigs();
    }

    function setDropFactor(val, btn) {
      bedConfigs[selectedStation - 1].dropFactor = val;
      document.querySelectorAll('.pill-btn').forEach(b => b.classList.remove('active'));
      btn.classList.add('active');
      calculateIVRate(false);
      dirtyBeds.add(selectedStation);
      updateDirtyNote();
    }

    function calculateIVRate(save = false) {
      onInputChanged();
      const cfg = bedConfigs[selectedStation - 1];
      if (cfg.volume <= 0 || cfg.hours <= 0) {
        if (save) alert('กรุณากรอกปริมาตรและเวลาให้สารน้ำให้ถูกต้อง');
        return;
      }

      const totalMins = cfg.hours * 60;
      cfg.gttMin = (cfg.volume * cfg.dropFactor) / totalMins;
      cfg.secPerDrop = cfg.gttMin > 0 ? (60 / cfg.gttMin) : 0;

      document.getElementById('gttMinDisplay').innerText = cfg.gttMin.toFixed(2);
      document.getElementById('secPerDropDisplay').innerText = cfg.secPerDrop.toFixed(2);

      if (save) {
        cfg.orderRate = Math.round((cfg.volume / cfg.hours) * 10) / 10;
        cfg.volTotal = cfg.volume;
        document.getElementById('orderRateInput').value = cfg.orderRate;
        document.getElementById('volTotalInput').value = cfg.volTotal;
        if (!document.getElementById('startTime2Input').value) document.getElementById('startTime2Input').value = cfg.startTime;
        calculateEndTime(false);
        pushBedConfig(selectedStation, true);
      }
      saveBedConfigs();

      if (document.getElementById('dropElement').classList.contains('animate')) startDrip();
    }

    function calculateEndTime(save = false) {
      onInputChanged();
      const cfg = bedConfigs[selectedStation - 1];
      if (cfg.volTotal <= 0 || cfg.orderRate <= 0) {
        if (save) alert('กรุณากรอกปริมาณสารน้ำและ Rate ให้ถูกต้อง');
        return;
      }

