kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
      const durationHours = cfg.volTotal / cfg.orderRate;
      const totalMinsAll = Math.round(durationHours * 60);
      const h = Math.floor(totalMinsAll / 60);
      const m = totalMinsAll % 60;
      cfg.durationText = `${h} ชั่วโมง ${m} นาที`;

      if (cfg.startTime2) {
        const [stH, stM] = cfg.startTime2.split(':').map(Number);
        const endTotalMins = (stH * 60 + stM + totalMinsAll) % 1440;
        const endH = String(Math.floor(endTotalMins / 60)).padStart(2, '0');
        const endM = String(endTotalMins % 60).padStart(2, '0');
        cfg.endTime2Text = `หมดเวลา ${endH}:${endM} น.`;
      }

      recalcDerived(cfg);
      document.getElementById('gttMinDisplay').innerText = cfg.gttMin.toFixed(2);
      document.getElementById('secPerDropDisplay').innerText = cfg.secPerDrop.toFixed(2);
      document.getElementById('durationText').innerText = cfg.durationText;
      document.getElementById('endTime2Text').innerText = cfg.endTime2Text;
      saveBedConfigs();

      if (save) pushBedConfig(selectedStation, true);
    }

    function startDrip() {
      const cfg = bedConfigs[selectedStation - 1];
      const dropEl = document.getElementById('dropElement');
      dropEl.classList.remove('animate');
      void dropEl.offsetWidth;
      dropEl.style.animationDuration = `${cfg.secPerDrop}s`;
      dropEl.classList.add('animate');
      document.getElementById('simStatus').innerText = `เตียง ${selectedStation}: หยดทุก ๆ ${cfg.secPerDrop.toFixed(2)} วินาที`;
    }

    function stopDrip() {
      document.getElementById('dropElement').classList.remove('animate');
      document.getElementById('simStatus').innerText = "สถานะ: หยุดจำลอง";
    }

    function selectStation(id) {
      selectedStation = id;
      document.querySelectorAll('.station-card').forEach(c => c.classList.remove('selected'));
      const activeCard = document.getElementById(`st-card-${id}`);
      if (activeCard) activeCard.classList.add('selected');
      loadBedToForm(id);
    }

    function getSignalMeta(rssi, isOnline) {
      if (!isOnline) return { lvl: 0, text: 'Offline', color: '#a0aec0' };
      if (rssi >= -60) return { lvl: 4, text: `${rssi} dBm (ดีเยี่ยม)`, color: '#38a169' };
      if (rssi >= -70) return { lvl: 3, text: `${rssi} dBm (ดี)`, color: '#3182ce' };
      if (rssi >= -80) return { lvl: 2, text: `${rssi} dBm (ปานกลาง)`, color: '#dd6b20' };
      return { lvl: 1, text: `${rssi} dBm (อ่อน)`, color: '#e53e3e' };
    }

    function renderStations(stationsData) {
      const container = document.getElementById('stationGridContainer');
      if (container.querySelector('.ack-btn:hover, .ack-btn:active')) return;   // ไม่วาดทับขณะกำลังกดปุ่มรับทราบ
      container.innerHTML = '';
      let hasAlarm = false;

      stationsData.forEach(st => {
        const isSel = (st.id === selectedStation) ? 'selected' : '';
        const targetRate = st.targetRate;
        const targetGtt = targetRate > 0 ? ((targetRate * st.dropFactor) / 60).toFixed(1) : '-';
        const isPaused = st.online && !st.running;
        const meta = ALERT_META[st.alertCode] || ALERT_META[0];

        let statusBadge = '';
        let cardState = '';
        let isAlarm = false;

        if (!st.online) {
          statusBadge = '<span class="badge-status badge-offline">○ Offline</span>';
        } else if (isPaused) {
          statusBadge = '<span class="badge-status badge-paused">⏸️ หยุดชั่วคราว</span>';
          cardState = 'paused-state';
        } else {
          statusBadge = `<span class="badge-status ${meta.cls}">${meta.text}</span>`;
          cardState = meta.card;
          isAlarm = meta.alarm;
        }
        if (isAlarm) hasAlarm = true;
        const nearPending = st.online && st.running && st.alertCode === 3 && !st.nearEndAck;
        if (nearPending && !nearChimed[st.id]) { nearChimed[st.id] = true; playNearEndChime(); }
        if (!nearPending) nearChimed[st.id] = false;
        const nearMl = st.planVolume > 0 ? Math.round(st.planVolume * st.nearEndPct / 100) : 0;
        const nearHtml = st.planVolume > 0
          ? `<div class="near-line">🔔 เตือนเตรียมถุงใหม่ที่ ${st.nearEndPct}% (${nearMl} mL)${st.alertCode === 3 && st.nearEndAck ? ' — รับทราบแล้ว' : ''}</div>`
          : '';
        const ackHtml = nearPending
          ? `<button class="ack-btn" onclick="acknowledgeNearEnd(${st.id}, event)">✅ รับทราบ เตรียมถุงใหม่ให้เตียง ${st.id}</button>`
          : '';

        const sig = getSignalMeta(st.rssi, st.online);
        const batText = st.battery > 0.5
          ? `🔋 ${st.battery.toFixed(2)}V (${Math.min(100, Math.max(0, Math.round(((st.battery - 3.2) / (4.2 - 3.2)) * 100)))}%)`
          : '🔋 N/A';
        const progress = st.planVolume > 0 ? Math.min(100, (st.volumeMl / st.planVolume) * 100) : 0;
        const planText = st.planVolume > 0 ? ` / ${st.planVolume} mL (${progress.toFixed(0)}%)` : ' mL (ยังไม่ตั้งแผน)';

        const card = document.createElement('div');
        card.className = `station-card ${isSel} ${cardState}`;
        card.id = `st-card-${st.id}`;
        card.onclick = () => selectStation(st.id);

        card.innerHTML = `
          <div class="station-header">
            <div>
              <div class="station-title">🛏️ เตียง ${st.id}</div>
              <div class="patient-label">👤 ${escapeHtml(st.patientName) || 'ระบุชื่อคนไข้'}</div>
            </div>
            ${statusBadge}
          </div>
          <div class="telemetry-row">
            <span style="color:${sig.color}; font-weight:600;">📶 ${sig.text}</span>
            <span style="font-weight:600; color:#4a5568;">${batText}</span>
            <div class="signal-bars lvl-${sig.lvl}">
              <div class="bar b1"></div>
              <div class="bar b2"></div>
              <div class="bar b3"></div>
              <div class="bar b4"></div>
            </div>
          </div>
          <div class="stat-row">
            <span>หยดสะสม:</span>
            <span class="val">${st.totalDrops} drops</span>
          </div>
          <div class="stat-row">
            <span>ปริมาตรให้แล้ว:</span>
            <span class="val" style="color:#2b6cb0;">${st.volumeMl.toFixed(1)}${planText}</span>
          </div>
          <div class="progress-track"><div class="progress-fill" style="width:${progress}%"></div></div>
          ${nearHtml}
          <div class="stat-row">
            <span>Actual Rate:</span>
            <span class="val" style="color:${isAlarm ? '#e53e3e' : (isPaused ? '#d97706' : '#2f855a')};">
              ${isPaused ? '0.0 (PAUSED)' : st.flowRateHr.toFixed(1) + ' mL/hr'}
            </span>
          </div>
          <div class="compare-box">
            <span>Target: <b>${targetGtt} gtt/min</b> (${targetRate > 0 ? targetRate + ' mL/hr' : 'ยังไม่ตั้ง'})</span>
            <span>${st.dropFactor} gtt/mL</span>
          </div>
          ${ackHtml}
        `;
        container.appendChild(card);
      });

      if (hasAlarm) playAlarmTone();
    }

    function switchGraphStation(stationId, tabEl) {
      activeGraphStation = stationId;
      renderTabs();
      renderGraphs();
    }

    function drawLineChart(canvasId, labels, dataPoints, unit, lineColor, fillColor) {
      const canvas = document.getElementById(canvasId);
      if (!canvas) return;
      const ctx = canvas.getContext('2d');
      const dpr = window.devicePixelRatio || 1;
      const rect = canvas.getBoundingClientRect();
      canvas.width = rect.width * dpr;
      canvas.height = rect.height * dpr;
      ctx.scale(dpr, dpr);

      const w = rect.width, h = rect.height;
      ctx.clearRect(0, 0, w, h);
      const padL = 48, padR = 20, padT = 28, padB = 32;
      const plotW = w - padL - padR, plotH = h - padT - padB;

      if (dataPoints.length === 0) {
        ctx.fillStyle = '#a0aec0';
        ctx.font = '14.5px sans-serif';
        ctx.textAlign = 'center';
        ctx.fillText('ยังไม่มีข้อมูลประวัติย้อนหลังสำหรับเตียงนี้', w / 2, h / 2);
        return;
      }

