kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
      const maxVal = Math.max(...dataPoints, 10) * 1.15;
      const minVal = 0;

      ctx.strokeStyle = '#e2e8f0';
      ctx.lineWidth = 1;
      ctx.fillStyle = '#718096';
      ctx.font = '11px sans-serif';
      ctx.textAlign = 'right';

      const ySteps = 4;
      for (let i = 0; i <= ySteps; i++) {
        const val = minVal + ((maxVal - minVal) / ySteps) * i;
        const y = padT + plotH - (plotH / ySteps) * i;
        ctx.beginPath(); ctx.moveTo(padL, y); ctx.lineTo(w - padR, y); ctx.stroke();
        ctx.fillText(val.toFixed(0), padL - 6, y + 4);
      }

      const n = dataPoints.length;
      const stepX = n > 1 ? plotW / (n - 1) : plotW;
      const points = [];

      for (let i = 0; i < n; i++) {
        const x = padL + (n === 1 ? plotW / 2 : i * stepX);
        const y = padT + plotH - ((dataPoints[i] - minVal) / (maxVal - minVal)) * plotH;
        points.push({ x, y, val: dataPoints[i], label: labels[i] });
      }

      if (points.length > 1) {
        const grad = ctx.createLinearGradient(0, padT, 0, padT + plotH);
        grad.addColorStop(0, fillColor);
        grad.addColorStop(1, 'rgba(255, 255, 255, 0)');
        ctx.beginPath();
        ctx.moveTo(points[0].x, padT + plotH);
        for (let pt of points) ctx.lineTo(pt.x, pt.y);
        ctx.lineTo(points[points.length - 1].x, padT + plotH);
        ctx.closePath();
        ctx.fillStyle = grad;
        ctx.fill();
      }

      ctx.beginPath();
      ctx.strokeStyle = lineColor;
      ctx.lineWidth = 2.5;
      ctx.moveTo(points[0].x, points[0].y);
      for (let i = 1; i < points.length; i++) ctx.lineTo(points[i].x, points[i].y);
      ctx.stroke();

      points.forEach((pt, idx) => {
        ctx.beginPath();
        ctx.arc(pt.x, pt.y, 4, 0, Math.PI * 2);
        ctx.fillStyle = '#ffffff';
        ctx.fill();
        ctx.lineWidth = 2;
        ctx.strokeStyle = lineColor;
        ctx.stroke();

        if (idx === 0 || idx === points.length - 1 || idx % 10 === 0) {
          ctx.fillStyle = '#718096';
          ctx.textAlign = 'center';
          ctx.font = '11px sans-serif';
          ctx.fillText(`-${pt.label}m`, pt.x, h - 10);
        }
      });
    }

    function drawBarChart(canvasId, labels, dataPoints, barColor) {
      const canvas = document.getElementById(canvasId);
      if (!canvas) return;
      const ctx = canvas.getContext('2d');
      const dpr = window.devicePixelRatio || 1;
      const rect = canvas.getBoundingClientRect();
      canvas.width = rect.width * dpr;
      canvas.height = rect.height * dpr;
      ctx.scale(dpr, dpr);

      const w = rect.width, h = rect.height;
      ctx.clearRect(0, 0, w, h);
      const padL = 48, padR = 20, padT = 28, padB = 32;
      const plotW = w - padL - padR, plotH = h - padT - padB;

      if (dataPoints.length === 0) {
        ctx.fillStyle = '#a0aec0';
        ctx.font = '14.5px sans-serif';
        ctx.textAlign = 'center';
        ctx.fillText('ยังไม่มีข้อมูลหยดน้ำสำหรับเตียงนี้', w / 2, h / 2);
        return;
      }

      const maxVal = Math.max(...dataPoints, 10) * 1.15;
      const ySteps = 4;
      ctx.strokeStyle = '#e2e8f0';
      ctx.lineWidth = 1;
      ctx.fillStyle = '#718096';
      ctx.font = '11px sans-serif';
      ctx.textAlign = 'right';

      for (let i = 0; i <= ySteps; i++) {
        const val = (maxVal / ySteps) * i;
        const y = padT + plotH - (plotH / ySteps) * i;
        ctx.beginPath(); ctx.moveTo(padL, y); ctx.lineTo(w - padR, y); ctx.stroke();
        ctx.fillText(val.toFixed(0), padL - 6, y + 4);
      }

      const n = dataPoints.length;
      const barWidth = Math.max(2, (plotW / n) * 0.7);
      const gap = plotW / n;
      ctx.fillStyle = barColor;

      for (let i = 0; i < n; i++) {
        const barH = (dataPoints[i] / maxVal) * plotH;
        const x = padL + i * gap + (gap - barWidth) / 2;
        const y = padT + plotH - barH;
        ctx.fillRect(x, y, barWidth, barH);

        if (i === 0 || i === n - 1 || i % 10 === 0) {
          ctx.fillStyle = '#718096';
          ctx.textAlign = 'center';
          ctx.font = '11px sans-serif';
          ctx.fillText(`-${labels[i]}m`, x + barWidth / 2, h - 10);
          ctx.fillStyle = barColor;
        }
      }
    }

    function renderGraphs() {
      fetch(`/api/logs?station=${activeGraphStation}`)
        .then(res => res.json())
        .then(data => {
          if (!data.logs || data.logs.length === 0) {
            drawLineChart('flowRateCanvas', [], [], 'mL/hr', '#0072ff', 'rgba(0,114,255,0.2)');
            drawBarChart('dropsCanvas', [], [], '#38a169');
            document.getElementById('graphPeakRate').innerText = "0.0";
            document.getElementById('graphMinRate').innerText = "0.0";
            document.getElementById('graphAvgRate').innerText = "0.0";
            document.getElementById('graphTotalVol').innerText = "0.00";
            return;
          }

          const labels = [];
          const rateData = [];
          const dropsData = [];
          let sumRate = 0, sumDrops = 0;
          let peak = 0, min = 999999;

          for (let i = 0; i < data.logs.length; i++) {
            const item = data.logs[i];
            const minsAgo = data.logs.length - 1 - i;
            labels.push(minsAgo);
            rateData.push(item.rate);
            dropsData.push(item.drops);
            sumRate += item.rate;
            sumDrops += item.drops;
            if (item.rate > peak) peak = item.rate;
            if (item.rate < min) min = item.rate;
          }

          if (min === 999999) min = 0;

          document.getElementById('graphPeakRate').innerText = peak.toFixed(1);
          document.getElementById('graphMinRate').innerText = min.toFixed(1);
          document.getElementById('graphAvgRate').innerText = (sumRate / data.logs.length).toFixed(1);
          document.getElementById('graphTotalVol').innerText = (sumDrops / (data.dropFactor || 20)).toFixed(2);

          drawLineChart('flowRateCanvas', labels, rateData, 'mL/hr', '#0072ff', 'rgba(0,114,255,0.2)');
          drawBarChart('dropsCanvas', labels, dropsData, '#38a169');
        })
        .catch(err => console.log(err));
    }

    function switchLogTab(stationId, tabEl) {
      activeLogTab = stationId;
      renderTabs();
      fetchLogs();
    }

    function fetchLogs() {
      fetch(`/api/logs?station=${activeLogTab}`)
        .then(res => res.json())
        .then(data => {
          const tbody = document.getElementById('logTableBody');
          tbody.innerHTML = '';

          if (!data.logs || data.logs.length === 0) {
            tbody.innerHTML = `<tr><td colspan="9" style="text-align: center; color: var(--text-muted); padding: 22px; font-size:14.5px;">ยังไม่มีข้อมูลบันทึกสำหรับ เตียง ${activeLogTab}</td></tr>`;
            document.getElementById('logSumDrops').innerText = "0";
            document.getElementById('logSumVolume').innerText = "0.00";
            document.getElementById('logAvgRate').innerText = "0.00";
            return;
          }

