kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-V_4_7_0/ESP32-S3-Host-V_4_7_0.ino
          let sumDrops = 0;
          let sumRate = 0;

          for (let i = data.logs.length - 1; i >= 0; i--) {
            const item = data.logs[i];
            sumDrops += item.drops;
            sumRate += item.rate;

            const row = document.createElement('tr');
            row.innerHTML = `
              <td><b>${item.min}</b></td>
              <td><span style="color:#2b6cb0; font-weight:600;">${item.time}</span></td>
              <td><b>${item.drops}</b> drops</td>
              <td>${item.vol} mL</td>
              <td><span style="color:#2f855a; font-weight:700;">${item.rate}</span> mL/hr</td>
              <td>${item.target} mL/hr</td>
              <td>${(ALERT_META[item.alert] || ALERT_META[0]).text}</td>
              <td>${item.rssi} dBm</td>
              <td>${item.battery > 0.5 ? item.battery + ' V' : 'N/A'}</td>
            `;
            tbody.appendChild(row);
          }

          document.getElementById('logSumDrops').innerText = sumDrops;
          document.getElementById('logSumVolume').innerText = (sumDrops / (data.dropFactor || 20)).toFixed(2);
          document.getElementById('logAvgRate').innerText = (sumRate / data.logs.length).toFixed(2);
        })
        .catch(err => console.log(err));
    }

    function downloadShiftCSV() {
      window.location.href = `/api/logs/csv?station=${activeLogTab}`;
    }

    function openApModal() { document.getElementById('apModal').style.display = 'flex'; fetchApStatus(); }
    function closeApModal() { document.getElementById('apModal').style.display = 'none'; }
    function fetchApStatus() {
      fetch('/api/ap/status').then(r=>r.json()).then(d=>{
        document.getElementById('apDetailBox').innerHTML =
          `<b>ชื่อ Wi-Fi (SSID):</b> ${d.ssid}<br>` +
          `<b>รหัสผ่าน:</b> ${d.password}<br>` +
          `<b>ที่อยู่หน้าเว็บ:</b> http://${d.apIP}<br>` +
          `<b>ช่องสัญญาณ:</b> ${d.channel}<br>` +
          `<b>อุปกรณ์ที่ต่ออยู่:</b> ${d.clients} / ${d.maxClients} เครื่อง<br>` +
          `<b>เวลาเครื่อง:</b> ${d.currentTime}`;
      }).catch(e=>{ document.getElementById('apDetailBox').innerText = 'อ่านข้อมูลไม่สำเร็จ'; });
    }

    // ตั้งเวลาให้ Host จากนาฬิกาของเครื่องที่เปิดหน้านี้ (ใช้แทน NTP เพราะไม่มีอินเทอร์เน็ต)
    function syncHostTime() {
      const epoch = Math.floor(Date.now() / 1000);
      fetch(`/api/time/set?epoch=${epoch}`, {method:'POST'}).catch(e=>console.log(e));
    }

    setInterval(() => {
      if (document.hidden) return;   // ไม่ดึงข้อมูลเมื่อสลับแท็บ/ปิดจอ ลดภาระเมื่อมีผู้ใช้หลายเครื่อง
      fetch('/api/data')
        .then(res => res.json())
        .then(data => {
          activeBedCount = data.activeCount;
          document.getElementById('activeBedCountLabel').innerText = activeBedCount;

          const hVolts = data.hostBatVolts;
          const hPct = data.hostBatPct;
          const hostEl = document.getElementById('hostBatDisplay');
          if (hVolts > 0.5) {
            hostEl.innerText = `🔋 Host: ${hVolts.toFixed(2)}V (${hPct}%)`;
            if (hPct <= 20) {
              hostEl.style.background = '#e53e3e';
              hostEl.style.color = '#ffffff';
            } else {
              hostEl.style.background = 'rgba(0,0,0,0.2)';
              hostEl.style.color = '#ffffff';
            }
          } else {
            hostEl.innerText = '⚡ Host: USB Power';
            hostEl.style.background = 'rgba(0,0,0,0.2)';
          }

          let timeNote = '';
          if (!data.timeSynced) timeNote = data.timeApprox ? ' (เวลาโดยประมาณ)' : ' (ยังไม่ตั้งเวลา)';
          document.getElementById('hostClockDisplay').innerText = data.currentTime + timeNote;
          document.getElementById('netStatusSubtitle').innerText =
            `AP: 192.168.4.1 · CH ${data.channel} · อุปกรณ์ ${data.apClients}/${data.apMaxClients} เครื่อง`;
          lastHostData = data;
          syncConfigsFromHost(data.stations);
          renderStations(data.stations);
          updateHostCfgNote();
        })
        .catch(err => console.log(err));
    }, 1000);

    setInterval(() => {
      if (document.getElementById('tab-graphs').classList.contains('active')) renderGraphs();
      if (document.getElementById('tab-logs').classList.contains('active')) fetchLogs();
    }, 15000);

    renderTabs();
    loadBedToForm(1);
    syncHostTime();
    setInterval(syncHostTime, 600000);   // ปรับเวลาให้ตรงทุก 10 นาที ระหว่างที่ยังเปิดหน้านี้
  </script>
</body>
</html>
)rawliteral";

void handleRoot() {
  if (!server.authenticate(web_username, web_password)) {
    return server.requestAuthentication();
  }
  server.send_P(200, "text/html", PAGE_INDEX);
}

// ==========================================
//  Setup & Initialization
// ==========================================
void setup() {
  Serial.begin(115200);

  rtc_gpio_deinit((gpio_num_t)POWER_BTN_PIN);   // คืนขาจากโหมด RTC หลังตื่นจาก deep sleep
  pinMode(POWER_BTN_PIN, INPUT_PULLUP);
  esp_sleep_wakeup_cause_t wakeup_reason = esp_sleep_get_wakeup_cause();

  if (wakeup_reason == ESP_SLEEP_WAKEUP_EXT0 || wakeup_reason == ESP_SLEEP_WAKEUP_GPIO) {
    unsigned long pressStart = millis();
    bool validHoldToTurnOn = false;

    while (digitalRead(POWER_BTN_PIN) == LOW) {
      if (millis() - pressStart >= 1500) {
        validHoldToTurnOn = true;
        break;
      }
      delay(10);
    }

    if (!validHoldToTurnOn) {
      while (digitalRead(POWER_BTN_PIN) == LOW) delay(10);
      delay(100);
      enterDeepSleepWaitPowerButton();
    }

    while (digitalRead(POWER_BTN_PIN) == LOW) delay(10);
    delay(150);
  }

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);
  pinMode(HOST_BAT_ADC_PIN, INPUT);

  pinMode(PAGE_BTN_PIN, INPUT_PULLUP);
  pinMode(BUZZER_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);

  Wire.begin(OLED_SDA_PIN, OLED_SCL_PIN);
  u8g2.begin();
  u8g2.clearBuffer();

  u8g2.drawRFrame(0, 0, 128, 64, 4);
  u8g2.setFont(u8g2_font_7x14B_tf);
  u8g2.drawStr(14, 18, "SMART IV ALERT");
  u8g2.drawHLine(8, 23, 112);

  u8g2.setFont(u8g2_font_5x8_tf);
  u8g2.drawStr(14, 35, "Central Host Gateway");
  u8g2.setFont(u8g2_font_4x6_tf);
  u8g2.drawStr(14, 45, "BCN Phrae & MCU Collab");
  u8g2.drawStr(14, 55, "Host v" APP_VERSION " / Proto v3");
  u8g2.sendBuffer();

  hostBatteryVolts = readHostBattery();
  hostBatteryPct = calculateBatteryPct(hostBatteryVolts);

